Tekla.Structures.ModelInternal.dotBuildingHierarchyBuildingOperation_t
Serialization structure for building hierarchy building operation.

Tekla.Structures.ModelInternal.dotBuildingHierarchyBuildingOperation_t.id
Field for building id.

Tekla.Structures.ModelInternal.dotBuildingHierarchyBuildingOperation_t.aGuid
The guid of the building hierarchy building.

Tekla.Structures.ModelInternal.dotBuildingHierarchyBuildingOperation_t.aName
Name of the building hierarchy building.

Tekla.Structures.ModelInternal.dotBuildingHierarchyBuildingOperation_t.OperationType
Defines if this is a create, read, update, or delete operation.
Tekla.Structures.ModelInternal.dotObjectOperationsEnum

Tekla.Structures.ModelInternal.dotBuildingHierarchyBuildingOperation_t.ItemType
Defines the item type. By default for building it is DOT_BUILDINGHIERARCHY_BUILDING. For building section, it is DOT_BUILDINGHIERARCHY_CHILDBUILDING.
All other values are invalid for building.
Tekla.Structures.ModelInternal.dotBuildingHierarchyItemType_e

Tekla.Structures.ModelInternal.dotBuildingHierarchyBuildingOperation_t.aDescription
The description of the building hierarchy building.

Tekla.Structures.ModelInternal.dotBuildingHierarchyBuildingOperation_t.BottomElevation
The building bottom z-level.

Tekla.Structures.ModelInternal.dotBuildingHierarchyBuildingOperation_t.TopElevation
The building top-z-level.

Tekla.Structures.ModelInternal.dotBuildingHierarchyBuildingOperation_t.Contour
The contour points for building.